Furkanprlk/DSP_F28335_Examples/src/libs/app_libs/SFRA/v1_10_00_00/examples/DPSWrkShpKit_SFRA_F28069/DPSWrkShpKit_SFRA-Main.c
// Used for ADC Configuration 
int 	ChSel[16] =   {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
int		TrigSel[16] = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
int     ACQPS[16] =   {8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8};

// ---------------------------------- USER -----------------------------------------
// ---------------------------- DPLIB Net Pointers ---------------------------------
// Declare net pointers that are used to connect the DP Lib Macros  here 
void ADC_SOC_CNF(int ChSel[], int Trigsel[], int ACQPS[], int IntChSel, int mode);
extern void DacDrvCnf(int16 n, int16 DACval, int16 DACsrc, int16 RAMPsrc, int16 Slope_initial);

// System Flags
int16	FaultFlg1 = 0;			// Fault flag set on over current condition
int16 	ClearFault1 = 0;
int16	Active_LD1_EN = 0;
int16 Itrip1 = _IQ15(0.8);

volatile float32 Vref1 = 0;			// Output Set Voltage
volatile float32 Vout1_slew_temp = 0;		// Temp variable: used only if implementing
										// slew rate control in the slower state machine
volatile float32 Vout1SetSlewed=0;	// Slewed set point for the FB voltage loop - start from 4V
volatile float32 Vout1SetSlewed_With_Inject=0;
volatile float32 Vout1SlewRate = 0.01;			// FB Slew rate adjustment

// DECLARE THE 3P3Z OBJECT
#pragma DATA_SECTION(cntl3p3z_vars1,"cntl_var_RAM")
#pragma DATA_SECTION(cntl3p3z_coeff1,"cntl_coeff_RAM")
CNTL_3P3Z_F_VARS cntl3p3z_vars1;
CNTL_3P3Z_F_COEFFS cntl3p3z_coeff1;

volatile float32 Vout1_Read;
volatile float32 Duty_pu,Duty_pu_DC,Duty_pwm;
volatile Uint16 duty;
// Measurement Offsets
float offset_Vout;
//Offset filter coefficient K1: 0.05/(T+0.05);
float K1 = _IQ(0.998);
//Offset filter coefficient K2: T/(T+0.05)
float K2 = _IQ(0.001999);
int16 OffsetCalCounter;

// SFRA lib Object
SFRA_F SFRA1;
// SFRA Variables
float32 Plant_MagVect[SFRA_FREQ_LENGTH];
float32 Plant_PhaseVect[SFRA_FREQ_LENGTH];
float32 OL_MagVect[SFRA_FREQ_LENGTH];
float32 OL_PhaseVect[SFRA_FREQ_LENGTH];
float32 FreqVect[SFRA_FREQ_LENGTH];

//Flag for reinitializing SFRA variables
int16 initializationFlag;

//extern to access tables in ROM
extern long FPUsinTable[];

// Transient Check
//DLOG_1CH_F dlog_1ch1;
//int16 DBUFF_1CH1[100];
//int16 dval1;


//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
// VARIABLE DECLARATIONS - CCS WatchWindow / GUI support
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

// -------------------------------- FRAMEWORK --------------------------------------

//GUI support variables
// sets a limit on the amount of external GUI controls - increase as necessary
int16 	*varSetTxtList[16];					//16 textbox controlled variables
int16 	*varSetBtnList[16];					//16 button controlled variables
int16 	*varSetSldrList[16];				//16 slider controlled variables
int16 	*varGetList[16];					//16 variables sendable to GUI
int32 	*arrayGetList[16];					//16 arrays sendable to GUI
Uint32   *dataSetList[16];					//16 32-bit textbox or label controlled variables

int16  	LedBlinkCnt;

// ---------------------------------- USER -----------------------------------------

// Monitor ("Get")						// Display as:
int16	Gui_Vin;							// Q5
int16	Gui_IL1;							// Q12
int16	Gui_Vout1;							// Q10


// Configure ("Set")
float32	Gui_VSet1 = 0;						// Q11




//Scaling Constants (values found via spreadsheet; exact value calibrated per board)
int16	K_Vin;								// Q15
int16	K_IL1;								// Q15

int16	K_Vout1;							// Q15 


int16	iK_IL1;								// Q14

int16	iK_Vout1;							// Q14


// Variables for background support only (no need to access)
int16	i;								// common use incrementer
Uint32	HistPtr, temp_Scratch; 			// Temp here means Temporary

// History arrays are used for Running Average calculation (boxcar filter)
// Used for CCS display and GUI only, not part of control loop processing
int16	Hist_Vin[HistorySize];
int16	Hist_IL1[HistorySize];
int16	Hist_Vout1[HistorySize];


int32 delayStart;

//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
// MAIN CODE - starts here
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
void main(void)
{

//=================================================================================
//	INITIALIZATION - General
//=================================================================================

	// The DeviceInit() configures the clocks and pin mux registers 
	// The function is declared in {ProjectName}-DevInit_F2803/2x.c,
	// Please ensure/edit that all the desired components pin muxes 
	// are configured properly that clocks for the peripherals used
	// are enabled, for example the individual PWM clock must be enabled 
	// along with the Time Base Clock 

	DeviceInit();	// Device Life support & GPIO

//-------------------------------- FRAMEWORK --------------------------------------

// Only used if running from FLASH
// Note that the variable FLASH is defined by the compiler with -d FLASH

#ifdef FLASH		
// Copy time critical code and Flash setup code to RAM
// The  RamfuncsLoadStart, RamfuncsLoadEnd, and RamfuncsRunStart
// symbols are created by the linker. Refer to the linker files. 
	MemCopy(&RamfuncsLoadStart, &RamfuncsLoadEnd, &RamfuncsRunStart);

// Call Flash Initialization to setup flash waitstates
// This function must reside in RAM
	InitFlash();	// Call the flash wrapper init function
#endif //(FLASH)
	SCIA_Init(20000000, 57600); // 20000000 is the LSPCLK or the Clock used for the SCI Module
								// 57600 is the Baudrate desired of the SCI module


// Timing sync for background loops
// Timer period definitions found in PeripheralHeaderIncludes.h
	CpuTimer0Regs.PRD.all =  mSec0_5;		// A tasks
	CpuTimer1Regs.PRD.all =  mSec10;	// B tasks
	CpuTimer2Regs.PRD.all =  mSec100;	// C tasks

// Tasks State-machine init
	Alpha_State_Ptr = &A0;
	A_Task_Ptr = &A1;
	B_Task_Ptr = &B1;
	C_Task_Ptr = &C1;

	VTimer0[0] = 0;	
	VTimer1[0] = 0;
	VTimer2[0] = 0;
	LedBlinkCnt = 5;

//#ifdef FLASH
  		CommsOKflg = 0;
  		SerialCommsTimer = 0;
  		//"Set" variables
  		// assign GUI Buttons to desired flag addresses
  		varSetBtnList[0] = (int16*)&initializationFlag;

