Furkanprlk/DSP_F28335_Examples/src/libs/app_libs/SFRA/v1_10_00_00/examples/DPSWrkShpKit_SFRA_F28069/DPSWrkShpKit_SFRA-Main.c
  		//"Get" variables
  		//---------------------------------------
  		// assign a GUI "getable" parameter address
  		varGetList[0] = (int16*)&(SFRA1.Vec_Length);			//int16
  		varGetList[1] = (int16*)&(SFRA1.status);			    //int16
  		varGetList[2] = (int16*)&(SFRA1.FreqIndex);					//int16

  		//"Setable" variables
  		//----------------------------------------
  		// assign GUI "setable" by Text parameter address
  		dataSetList[0] = (Uint32*)&(SFRA1.Freq_Start);      //Float 32
  		dataSetList[1] = (Uint32*)&(SFRA1.amplitude);	   //Float32
  		dataSetList[2] = (Uint32*)&(SFRA1.Freq_Step);	   //Float32

  		// assign a GUI "getable" parameter array address
  		arrayGetList[0] = (int32*)FreqVect;			        //Float 32
  		arrayGetList[1] = (int32*)OL_MagVect;			    //
  		arrayGetList[2] = (int32*)OL_PhaseVect;		        //
  		arrayGetList[3] = (int32*)Plant_MagVect;			//
  		arrayGetList[4] = (int32*)Plant_PhaseVect;			//
  		arrayGetList[5] = (int32*)&(SFRA1.Freq_Start);      //Float32
  		arrayGetList[6] = (int32*)&(SFRA1.amplitude);	   //Float32
  		arrayGetList[7] = (int32*)&(SFRA1.Freq_Step);	   //Float32
//#endif

	HistPtr = 0;
	
// ---------------------------------- USER -----------------------------------------
//  put common initialization/variable definitions here

//Configure Scaling Constants
	K_Vin = 27238;									// 0.831 in Q15 (see excel spreadsheet)
	K_IL1 = 22528;									// 0.688 in Q15 (see excel spreadsheet)
	K_Vout1 = 19994;								// 0.610 in Q15 (see excel spreadsheet)
	
	iK_Vout1 = 26852;								// 1.639 in Q14 (see excel spreadsheet)


	EALLOW;
	SysCtrlRegs.PCLKCR0.bit.TBCLKSYNC = 0; 
	EDIS;

//==================================================================================
//	INCREMENTAL BUILD OPTIONS - NOTE: selected via {ProjectName-Settings.h
//==================================================================================
// ---------------------------------- USER -----------------------------------------

// "Raw" (R) ADC measurement name defines
#define		Vout1R			AdcResult.ADCRESULT1	//
#define		IL1R			AdcResult.ADCRESULT2	//
#define		VinR	 		AdcResult.ADCRESULT3	//

// Channel Selection for Cascaded Sequencer
	ChSel[0] = 6;				// A6 -  Vout1 - Dummy
	ChSel[1] = 6;				// A6 -  Vout1
	ChSel[2] = 1;				// A1 -  IL1
	ChSel[3] = 9;				// B1 -  Vin

	TrigSel[0] = ADCTRIG_EPWM1_SOCA;	// Vout1 sampling triggered by EPWM1 SOCA - Dummy
	TrigSel[1] = ADCTRIG_EPWM1_SOCA; 	// Vout1 sampling triggered by EPWM1 SOCA
	TrigSel[2] = ADCTRIG_EPWM1_SOCA;	// IL1 inductor current sampling triggered by EPWM1 SOCA
	TrigSel[3] = ADCTRIG_EPWM1_SOCA;	// Vin sampling triggered by EPWM3 SOCA

	// Configure PWM1 for 200Khz switching Frequency 
	//Period Count= 80Mhz/200Khz = 400
	PWM_1ch_CNF(1, 400,1,0);

	// Configure ADC  
	ADC_SOC_CNF(ChSel,TrigSel,ACQPS, 16, 0);// ACQPS=8, No ADC channel triggers an interrupt IntChSel > 15, Mode= Start/Stop (0) 
  
	EPwm1Regs.ETSEL.bit.SOCAEN  =  1;
	EPwm1Regs.ETSEL.bit.SOCASEL =  ET_CTR_ZERO; // Use CTR = ZRO events as trigger 
    EPwm1Regs.ETPS.bit.SOCAPRD = 1; 	        // Generate pulse on 1st event  

	EPwm2Regs.ETSEL.bit.SOCAEN  =  1;
	EPwm2Regs.ETSEL.bit.SOCASEL =  ET_CTR_ZERO; // Use CTR = ZRO events as trigger 
    EPwm2Regs.ETPS.bit.SOCAPRD = 1; 	        // Generate pulse on 1st event  


//----------------------------------------------------------------------

    CNTL_3P3Z_F_VARS_init(&cntl3p3z_vars1);
    CNTL_3P3Z_F_COEFFS_init(&cntl3p3z_coeff1);

    /* 2.5 Khz Coeff */
    cntl3p3z_coeff1.Coeff_A1=(float32)1.1201983;
	cntl3p3z_coeff1.Coeff_A2=(float32)(-0.1201983);
	cntl3p3z_coeff1.Coeff_A3=(float32)(0.0);
	cntl3p3z_coeff1.Coeff_B0=(float32)(1.1951143);
	cntl3p3z_coeff1.Coeff_B1=(float32)(-1.1571392);
	cntl3p3z_coeff1.Coeff_B2=(float32)(-0.0060149);
	cntl3p3z_coeff1.Coeff_B3=(float32)(0.0);
	cntl3p3z_coeff1.IMin=(float32)(-0.1);
	cntl3p3z_coeff1.Max=(float32)(0.9);
	cntl3p3z_coeff1.Min=(float32)(0.0);

	// Do SFRA Object Initialization here

	//SFRA Object Initialization
	//Specify the injection amplitude
	SFRA1.amplitude=_IQ26(0.01);
	//Specify the length of SFRA
	SFRA1.Vec_Length=SFRA_FREQ_LENGTH;
	//Specify the SFRA ISR Frequency
	SFRA1.ISR_Freq=SFRA_ISR_FREQ;
	//Specify the Start Frequency of the SFRA analysis
	SFRA1.Freq_Start=SFRA_FREQ_START;
	//Specify the Frequency Step
	SFRA1.Freq_Step=FREQ_STEP_MULTIPLY;
	//Assign array location to Pointers in the SFRA object
	SFRA1.FreqVect=FreqVect;
	SFRA1.GH_MagVect=OL_MagVect;
	SFRA1.GH_PhaseVect=OL_PhaseVect;
	SFRA1.H_MagVect=Plant_MagVect;
	SFRA1.H_PhaseVect=Plant_PhaseVect;

	SFRA_F_INIT(&SFRA1);

	// Transient Tuning
//	DLOG_1CH_F_init(&dlog_1ch1);
//	dlog_1ch1.input_ptr = &dval1; //data value
//	dlog_1ch1.output_ptr = &DBUFF_1CH1[0];
//	dlog_1ch1.size = 100;
//	dlog_1ch1.pre_scalar = 5;
//	dlog_1ch1.trig_value = _IQ15(0.1);
//	dlog_1ch1.status = 2;


	//
	Duty_pwm=0;
	Duty_pu_DC=0;
	Duty_pu=0;
	Vout1_Read=0;

	delayStart=5000;


// Configure PWM1, Comparator1 and DAC for over current protection for channel 1
	EALLOW;	
// Define an event (DCAEVT1) based on Comparator 1 Output
	EPwm1Regs.DCTRIPSEL.bit.DCAHCOMPSEL = DC_COMP1OUT; 	// DCAH = Comparator 1 output
	EPwm1Regs.TZDCSEL.bit.DCAEVT1 = TZ_DCAH_HI; 		// DCAEVT1 = DCAH high(will become active
														// as Comparator output goes high)
	EPwm1Regs.DCACTL.bit.EVT1SRCSEL = DC_EVT1; 			// DCAEVT1 = DCAEVT1 (not filtered)
	EPwm1Regs.DCACTL.bit.EVT1FRCSYNCSEL = DC_EVT_ASYNC;	// Take async path

// Enable DCAEVT1 as a one-shot source
	EPwm1Regs.TZSEL.bit.DCAEVT1 = 1;

// What do we want the DCAEVT1 event to do?
	EPwm1Regs.TZCTL.bit.TZA = TZ_FORCE_LO; 				// EPWMxA will go low 
	EDIS;

	DacDrvCnf(1, Itrip1, 0, 2, 0);		// Comp1, DACval = Itrip1, DAC Source is DACval, Ramp Source = don't care, Slope = don't care
//===========================================================================
//Active load PWM drive configuration
//===========================================================================
	//Time Base SubModule Register
	EPwm3Regs.TBCTL.bit.PRDLD = TB_IMMEDIATE;	// set Immediate load
	EPwm3Regs.TBPRD = Active_load_PRD;
	EPwm3Regs.TBCTL.bit.CTRMODE = TB_COUNT_UPDOWN;
	EPwm3Regs.TBCTL.bit.HSPCLKDIV = TB_DIV4;
	EPwm3Regs.TBCTL.bit.CLKDIV = TB_DIV4;
	EPwm3Regs.TBCTL.bit.PHSEN = TB_DISABLE;
	EPwm3Regs.TBCTL.bit.SYNCOSEL = TB_SYNC_IN; 		// sync "down-stream" 
	
	// Counter compare submodule registers
	EPwm3Regs.CMPCTL.bit.LOADAMODE = CC_CTR_ZERO;
	EPwm3Regs.CMPCTL.bit.LOADBMODE = CC_CTR_ZERO;
	EPwm3Regs.CMPCTL.bit.SHDWAMODE = CC_SHADOW;
	EPwm3Regs.CMPCTL.bit.SHDWBMODE = CC_SHADOW;

	// Action Qualifier SubModule Registers
	EPwm3Regs.AQCTLA.bit.CAD = AQ_SET;
	EPwm3Regs.AQCTLA.bit.CAU = AQ_CLEAR;
	EPwm3Regs.AQCTLB.bit.CBD = AQ_SET;
	EPwm3Regs.AQCTLB.bit.CBU = AQ_CLEAR;

//====================================================================================
// INTERRUPTS & ISR INITIALIZATION (best to run this section after other initialization)
//====================================================================================
	EALLOW;
	SysCtrlRegs.PCLKCR0.bit.TBCLKSYNC = 1; 
	EPwm1Regs.ETSEL.bit.INTSEL = ET_CTR_PRD;  	// INT on PRD event
	EPwm1Regs.ETSEL.bit.INTEN = 1;              // Enable INT
	EPwm1Regs.ETPS.bit.INTPRD = ET_1ST;         // Generate INT on every event
	EDIS;
	
	/********* Run Calibration for offset ******/
	//TODO Run Calibration Task
	OffsetCalCounter=0;
	offset_Vout=0;
	while(OffsetCalCounter<10000)
	{
		if(EPwm1Regs.ETFLG.bit.INT==1)
		{
			offset_Vout= (K1*offset_Vout)+K2*(Vout1R*ADC_PU_SCALING);
			OffsetCalCounter++;
			EPwm1Regs.ETCLR.bit.INT=1;
		}
	}

// Set up C28x Interrupt

