Furkanprlk/DSP_F28335_Examples/src/libs/app_libs/SFRA/v1_10_00_00/examples/DPSWrkShpKit_SFRA_F28069/DPSWrkShpKit_SFRA-Main.c
//Also Set the appropriate # define's in the {ProjectName}-Settings.h 
//to enable interrupt management in the ISR
	EALLOW;
	// Configure PWM1 to issue interrupts
    PieVectTable.EPWM1_INT = &PWM_ISR;      	// Map Interrupt
   	PieCtrlRegs.PIEIER3.bit.INTx1 = 1;      	// PIE level enable, Grp3 / Int1
	EPwm1Regs.ETSEL.bit.INTSEL = ET_CTR_PRD;  	// INT on PRD event
   	EPwm1Regs.ETSEL.bit.INTEN = 1;              // Enable INT
    EPwm1Regs.ETPS.bit.INTPRD = ET_1ST;         // Generate INT on every event

    IER |= M_INT3;                          	// Enable CPU INT3 connected to EPWM1-6 INTs:
    EINT;                                   	// Enable Global interrupt INTM
    ERTM;                                   	// Enable Global realtime interrupt DBGM
	EDIS;      

//=================================================================================
//	BACKGROUND (BG) LOOP
//=================================================================================

//--------------------------------- FRAMEWORK -------------------------------------
	for(;;)  //infinite loop
	{
		// State machine entry & exit point
		//===========================================================
		(*Alpha_State_Ptr)();	// jump to an Alpha state (A0,B0,...)
		//===========================================================

		if(initializationFlag == 1)
		{
			SFRA_F_INIT(&SFRA1);
			initializationFlag = 0;
			SFRA1.start = 1;
		}
	}
} //END MAIN CODE



//=================================================================================
//	STATE-MACHINE SEQUENCING AND SYNCRONIZATION
//=================================================================================

//--------------------------------- FRAMEWORK -------------------------------------
void A0(void)
{
	// loop rate synchronizer for A-tasks
	if(CpuTimer0Regs.TCR.bit.TIF == 1)
	{
		CpuTimer0Regs.TCR.bit.TIF = 1;	// clear flag

		//-----------------------------------------------------------
		(*A_Task_Ptr)();		// jump to an A Task (A1,A2,A3,...)
		//-----------------------------------------------------------

		VTimer0[0]++;			// virtual timer 0, instance 0 (spare)
		SerialCommsTimer++;		// used by DSP280x_SciCommsGui_32bit.c Uncomment for FLASH w/GUI
	}

	Alpha_State_Ptr = &B0;		// Comment out to allow only A tasks
}

void B0(void)
{
	// loop rate synchronizer for B-tasks
	if(CpuTimer1Regs.TCR.bit.TIF == 1)
	{
		CpuTimer1Regs.TCR.bit.TIF = 1;				// clear flag

		//-----------------------------------------------------------
		(*B_Task_Ptr)();		// jump to a B Task (B1,B2,B3,...)
		//-----------------------------------------------------------
		VTimer1[0]++;			// virtual timer 1, instance 0 (spare)
	}

	Alpha_State_Ptr = &C0;		// Allow C state tasks
}

void C0(void)
{
	// loop rate synchronizer for C-tasks
	if(CpuTimer2Regs.TCR.bit.TIF == 1)
	{
		CpuTimer2Regs.TCR.bit.TIF = 1;				// clear flag

		//-----------------------------------------------------------
		(*C_Task_Ptr)();		// jump to a C Task (C1,C2,C3,...)
		//-----------------------------------------------------------
		VTimer2[0]++;			//virtual timer 2, instance 0 (spare)
	}

	Alpha_State_Ptr = &A0;	// Back to State A0
}


//=================================================================================
//	A - TASKS
//=================================================================================
//--------------------------------------------------------
void A1(void) 
//--------------------------------------------------------
{
	SFRA_F_BACKGROUND(&SFRA1);
	//-------------------
	//the next time CpuTimer0 'counter' reaches Period value go to A2
	A_Task_Ptr = &A2;
	//-------------------

}

//-----------------------------------------------------------------
void A2(void)   // Slew Rate
//-----------------------------------------------------------------
{	 
	// This is an example code for implementing the slew rate control in
	// a slower state machine instead of implementing it in the ISR.
	// VoutXSlewRate should be set as a positive value
	Vout1_slew_temp = Vref1 - Vout1SetSlewed;

	if (Vout1_slew_temp >= Vout1SlewRate) // Positive Command
	{
		Vout1SetSlewed = Vout1SetSlewed + Vout1SlewRate;
	}
	else
	{
		if ((-1)*(Vout1_slew_temp) >= Vout1SlewRate) // Negative Command
			{
			Vout1SetSlewed = Vout1SetSlewed - Vout1SlewRate;
			}
		else	Vout1SetSlewed = Vref1;
	}

	SerialHostComms();	// Uncomment for FLASH config

	//-------------------
	//the next time CpuTimer0 'counter' reaches Period value go to A1
	A_Task_Ptr = &A3;
	//-------------------
}

//-----------------------------------------
void A3(void)	// Active Load Enable/Disable
//-----------------------------------------
{
	
	if (Active_LD1_EN == 1)
	{
		EPwm3Regs.CMPA.half.CMPA = Active_load_PRD;
	}		
	else
	{
		EPwm3Regs.CMPA.half.CMPA = 0;
	}				


	if(delayStart==0)
	{
		Gui_VSet1=(2.0);
	}
	else
		delayStart--;
	
	//-----------------
	//the next time CpuTimer0 'counter' reaches Period value go to A1
	A_Task_Ptr = &A1;
	//-----------------
}





//=================================================================================
//	B - TASKS
//=================================================================================

//----------------------------------- USER ----------------------------------------

//----------------------------------------
void B1(void)
//----------------------------------------
{

// Voltage measurement calculated by:
//	Gui_Vin = VinAvg * K_Vin, where VfbinAvg = sum of 8 Vfb_inR samples
//	Gui_Voutx = VoutAvg * K_Vout, where VfboutAvg = sum of 8 Vfb_outR samples
 
	HistPtr++;
	if (HistPtr >= 8)	HistPtr = 0;

// BoxCar Averages - Input Raw samples into History arrays
//----------------------------------------------------------------
	Hist_Vin[HistPtr] = VinR; 			// Raw ADC result (Q12)

	temp_Scratch=0;
	for(i=0; i<HistorySize; i++)	temp_Scratch = temp_Scratch + Hist_Vin[i]; // Q12 * 8 = Q15
	Gui_Vin = ( (long) temp_Scratch * (long) K_Vin ) >> 15; // (Q15 * Q15)>>15 = Q15

// BoxCar Averages - Input Raw samples into History arrays
//----------------------------------------------------------------   
	Hist_Vout1[HistPtr] = Vout1R-(offset_Vout*4096.0); // Raw ADC result (Q12)

	temp_Scratch=0;
	for(i=0; i<HistorySize; i++)	temp_Scratch = temp_Scratch + Hist_Vout1[i]; // Q12 * 8 = Q15
	Gui_Vout1 = ( (long) temp_Scratch * (long) K_Vout1 ) >> 15; // (Q15 * Q15)>>15 = Q15

		
