Furkanprlk/DSP_F28335_Examples/src/libs/app_libs/SFRA/v1_10_00_00/examples/DPSWrkShpKit_SFRA_F28069/DPSWrkShpKit_SFRA-Main.c
// Current measurement calculated by:
//	Gui_Ifb = IfbAvg * K_Ifb, where IfbAvg = sum of 8 IfbR samples
//BoxCar Averages - Input Raw samples into History arrays 
	
	Hist_IL1[HistPtr] = IL1R; // Raw ADC result (Q12)

	temp_Scratch=0;
	for(i=0; i<HistorySize; i++)	temp_Scratch = temp_Scratch + Hist_IL1[i]; // Q12 * 8 = Q15
	if (temp_Scratch > 1549)	temp_Scratch = temp_Scratch - 1549;	//offset adjust
	else temp_Scratch  = 0;
	Gui_IL1 = ( (long) temp_Scratch * (long) K_IL1 ) >> 15; // (Q15 * Q15)>>15 = Q15





// Voltage setting calculated:
	Vref1= Gui_VSet1*Inv_VOUT_MAX;

	//the next time CpuTimer1 'counter' reaches Period value go to B2
	B_Task_Ptr = &B2;	
	//-----------------
}



//----------------------------------------
void B2(void) // Blink LED on the control CArd
//----------------------------------------
{
	if(LedBlinkCnt==0)
		{
			GpioDataRegs.GPBTOGGLE.bit.GPIO34 = 1;	//turn on/off LD3 on the controlCARD
			LedBlinkCnt=5;
		}
	else
			LedBlinkCnt--;
			
	//-----------------
	//the next time CpuTimer1 'counter' reaches Period value go to B3
	B_Task_Ptr = &B3;
	//-----------------
}

//----------------------------------------
void B3(void)  
//----------------------------------------
{
	//-----------------
	//the next time CpuTimer1 'counter' reaches Period value go to B4
	B_Task_Ptr = &B4;	
	//-----------------
}

//----------------------------------------
void B4(void) //  SPARE
//----------------------------------------
{
	//-----------------
	//the next time CpuTimer1 'counter' reaches Period value go to B1
	B_Task_Ptr = &B1;	
	//-----------------
}


//=================================================================================
//	C - TASKS
//=================================================================================

//--------------------------------- USER ------------------------------------------

//------------------------------------------------------
void C1(void) 	 // Fault Management
//------------------------------------------------------
{
	//TODO

	if (ClearFault1 == 1)
	{
		EALLOW;
		(*ePWM[1]).TZCLR.bit.OST = 1;
		EDIS;		
		ClearFault1 = 0;
	}

	if ( (*ePWM[1]).TZFLG.bit.OST == 1 )
		FaultFlg1 = 1; 
	else FaultFlg1 = 0;  
	//-----------------
	//the next time CpuTimer2 'counter' reaches Period value go to C2
	C_Task_Ptr = &C1;
	//-----------------

}



interrupt void PWM_ISR(void)
{
	//TODO PWM ISR

#if (INCR_BUILD==1)
	Vout1_Read = (float)Vout1R * (float)ADC_PU_SCALING;
	duty = (Uint16)((float) EPwm1Regs.TBPRD * Duty_pu );
	EPwm1Regs.CMPA.half.CMPA = duty;
//	//Read ADC and computer Fbk Value
//	Vout1_Read= _IQsat((((float32)Vout1R*ADC_PU_SCALING)-offset_Vout),1.0,0.0);
//
//	//Add SFRA injection into the duty cycle for the open loop converter
//	Duty_pu=SFRA_F_INJECT(Duty_pu_DC);
//
//	//Update PWM value
//	EPwm1Regs.CMPA.half.CMPA=_IQ24mpy((long)(BUCK_PWM_PERIOD),Duty_pu);
//
//	SFRA_F_COLLECT(&Duty_pu,&Vout1_Read);
#endif

#if (INCR_BUILD==2)

	//Read ADC and computer Fbk Value
	cntl3p3z_vars1.Fdbk= _IQsat((((float32)Vout1R*ADC_PU_SCALING)-offset_Vout),1.0,0.0);

	//Add SFRA injection into the reference of the controller
	cntl3p3z_vars1.Ref=SFRA_F_INJECT(Vout1SetSlewed);

	// Call the controller
	CNTL_3P3Z_F_ASM(&cntl3p3z_coeff1,&cntl3p3z_vars1);

	//Update PWM value
	EPwm1Regs.CMPA.half.CMPA=_IQ24mpy((long)(BUCK_PWM_PERIOD),cntl3p3z_vars1.Out);

	SFRA_F_COLLECT(&cntl3p3z_vars1.Out,&cntl3p3z_vars1.Fdbk);

#endif

//	dval1=_IQtoIQ15(Vout1SetSlewed);
//	DLOG_1CH_F_FUNC(&dlog_1ch1);


	EPwm1Regs.ETCLR.bit.INT=1;
	PieCtrlRegs.PIEACK.bit.ACK3=0x1;
}
